Repository: suheyla-turan/pet_app
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Settings
tr: Ayarlar

source: Profile
tr: Profilim

source: About
tr: Hakkında

# support
source: Support / Feedback
tr: Destek / Geri Bildirim

source: Info & Support
tr: Bilgi & Destek

source: Theme
tr: Tema

source: Notifications
tr: Bildirimler

source: Done
tr: Tamam

source: Language
tr: Dil

source: App Language
tr: Uygulama Dili

source: Enable Notifications
tr: Bildirimleri Etkinleştir

source: Advanced Notifications
tr: Gelişmiş Bildirimler

source: Update Interval
tr: Güncelleme Aralığı

# updateIntervalDescription
source: Select how often pet statuses are updated
tr: Hayvan durumlarının güncellenme sıklığını seçin

source: OK
tr: Tamam

# aiAskTitle
source: Ask AI a Question
tr: Yapay Zekaya Soru Sor

source: Recognized Text
tr: Tanınan Metin

# askHint
source: Type or ask your question...
tr: Sorunuzu yazın veya sesli sorun...

source: Voice Ask
tr: Sesli Sor

source: Stop Listening
tr: Dinlemeyi Durdur

# aiThinking
source: AI is thinking...
tr: AI düşünüyor...

source: Cancel
tr: İptal

source: Ask
tr: Sor

source: Add User
tr: Kullanıcı Ekle

# userEmailHint
source: User email address
tr: Kullanıcı e-posta adresi

source: Add
tr: Ekle

source: Pet ID not found!
tr: Pet ID bulunamadı!

source: User added!
tr: Kullanıcı eklendi!

source: User not found!
tr: Kullanıcı bulunamadı!

source: Main user cannot remove self!
tr: Ana kullanıcı kendini çıkaramaz!

# onlyMainUserCanRemove
source: Only main user can remove others!
tr: Sadece ana kullanıcı başkasını çıkarabilir!

# settingsDescription
source: Manage your app preferences
tr: Uygulama tercihlerinizi yönetin

# themeLight
source: Light
tr: Açık

# themeDark
source: Dark
tr: Karanlık

# themeSystem
source: System Default
tr: Sistem Varsayılanı

# themeLightDesc
source: Light theme
tr: Açık tema

# themeDarkDesc
source: Dark theme
tr: Karanlık tema

# themeSystemDesc
source: Use device theme
tr: Cihazın tema ayarını kullan

source: AI Conversation Style
tr: AI Konuşma Stili

# aiConversationStyleDesc
source: Choose how the AI assistant responds to you
tr: AI asistanın size nasıl yanıt vereceğini seçin

# aiFriendly
source: Friendly
tr: Dostane

# aiFriendlyDesc
source: Uses a warm and friendly tone
tr: Sıcak ve samimi bir ton kullanır

# aiProfessional
source: Professional
tr: Profesyonel

# aiProfessionalDesc
source: Uses a formal and informative tone
tr: Resmi ve bilgilendirici bir ton kullanır

# aiFun
source: Fun
tr: Eğlenceli

# aiFunDesc
source: Uses a playful and fun tone
tr: Eğlenceli ve oyuncu bir ton kullanır

# aiCompassionate
source: Compassionate
tr: Şefkatli

# aiCompassionateDesc
source: Uses a caring and protective tone
tr: Şefkatli ve koruyucu bir ton kullanır

source: Voice Settings
tr: Sesli Konuşma

# voiceSettingsDesc
source: Manage AI voice features
tr: AI ile sesli konuşma özelliklerini yönetin

# voiceAuto
source: Auto Voice Response
tr: Otomatik Sesli Yanıt

# voiceAutoDesc
source: Automatically read AI responses aloud
tr: AI cevaplarını otomatik olarak sesli oku

source: Voice Listen Feature
tr: Sesli Dinleme Özelliği

# voiceListenFeatureDesc
source: You can listen to any AI response by pressing the 'Listen' button under each AI message. You can listen manually even if auto voice is off.
tr: Her AI yanıtının altında 'Sesli Dinle' butonu bulunur. Bu buton ile istediğiniz zaman cevabı sesli dinleyebilirsiniz. Otomatik sesli yanıt kapalı olsa bile manuel olarak dinleyebilirsiniz.

# voiceTTS
source: Voice Response (TTS)
tr: Sesli Yanıt (TTS)

# voiceSpeaker
source: Speaker (Voice)
tr: Konuşmacı (Ses)

# voiceRate
source: Speech Rate
tr: Konuşma Hızı

# voicePitch
source: Pitch
tr: Ses Perdesi

# notificationsSound
source: Notification Sound
tr: Bildirim Sesi

# notificationsDefault
source: Default Sound
tr: Varsayılan Ses

# notificationsCustom
source: Custom Notification Sound
tr: Özel Bildirim Sesi

# notificationsBell
source: Bell Sound
tr: Zil Sesi

# notificationsChime
source: Chime Sound
tr: Çan Sesi

# notificationsAlert
source: Alert Sound
tr: Uyarı Sesi

source: Update
tr: Güncelleme

source: Auto Update
tr: Otomatik Güncelleme

# autoUpdateDesc
source: Automatically update pet statuses
tr: Hayvan durumlarını otomatik güncelle

# petTypeDog
source: Dog
tr: Köpek

# petTypeCat
source: Cat
tr: Kedi

# petTypeBird
source: Bird
tr: Kuş

# petTypeFish
source: Fish
tr: Balık

# petTypeRabbit
source: Rabbit
tr: Tavşan

# petTypeOther
source: Other
tr: Diğer

# genderMale
source: Male
tr: Erkek

# genderFemale
source: Female
tr: Dişi

source: Status Info
tr: Durum Bilgileri

source: Satiety
tr: Tokluk

source: Happiness
tr: Mutluluk

source: Energy
tr: Enerji

# maintenance
source: Care
tr: Bakım

source: Excellent!
tr: Mükemmel!

source: Quick Actions
tr: Hızlı İşlemler

source: Feed
tr: Besle

source: Pet
tr: Sev

source: Rest
tr: Dinlendir

source: Care
tr: Bakım

source: Breed
tr: Cins

source: Age
tr: Yaş

# yearsOld
source: {age} years old
tr: {age} yaşında

# birthDate
source: Birth Date: {day}/{month}/{year}
tr: Doğum Tarihi: {day}/{month}/{year}

source: Type
tr: Tür

source: Gender
tr: Cinsiyet

# settingsSection
source: Settings
tr: Ayarlar

# infoSupportSection
source: Info & Support
tr: Bilgi & Destek

source: Critical
tr: Kritik

source: Good
tr: İyi

source: Medium
tr: Orta

source: Low
tr: Düşük

# aboutDescription
source: This app is designed to make it easy to care for your pets, track vaccinations, take daily notes, and chat with AI.
tr: Bu uygulama, evcil hayvanlarınızın bakımını kolaylaştırmak, aşı takibini yapmak, günlük notlar almak ve yapay zeka ile sohbet edebilmek için geliştirilmiştir.

# ttsTurkishNotFound
source: Turkish TTS language not found, using English instead
tr: Türkçe TTS dili bulunamadı, İngilizce kullanılıyor

# ttsServiceFailed
source: Voice service could not be started
tr: Sesli konuşma servisi başlatılamadı

# speechNotEnabled
source: Speech recognition is not enabled
tr: Konuşma tanıma etkin değil

# onboardingWelcome
source: Welcome to PatiTakip!
tr: PatiTakip'e Hoş Geldin!

# onboardingDescription
source: Track your pets, vaccinations, and more.
tr: Evcil hayvanlarını, aşılarını ve daha fazlasını takip et.

source: Next
tr: İleri

source: Add Pet
tr: Evcil Hayvan Ekle

# addPetDescription
source: Add your pet to start tracking.
tr: Takip için evcil hayvanını ekle.

# vaccinationAndCare
source: Vaccination & Care
tr: Aşı & Bakım

# vaccinationAndCareDescription
source: Keep your pet healthy with reminders.
tr: Sağlıklı kalmak için hatırlatıcılar al.

# profileAndHistory
source: Profile & History
tr: Profil & Geçmiş

# profileAndHistoryDescription
source: View your profile and pet history.
tr: Profilini ve hayvan geçmişini görüntüle.

source: Start
tr: Başla

source: Login
tr: Giriş Yap

source: Email
tr: E-posta

# validEmail
source: Please enter a valid email address.
tr: Geçerli bir e-posta adresi girin.

source: Password
tr: Şifre

# min6Chars
source: Minimum 6 characters.
tr: En az 6 karakter.

source: Forgot Password?
tr: Şifremi Unuttum?

source: No account? Register
tr: Hesabın yok mu? Kayıt ol

source: Register
tr: Kayıt Ol

source: Name
tr: İsim

# enterName
source: Please enter your name.
tr: Lütfen isminizi girin.

# alreadyAccountLogin
source: Already have an account? Login
tr: Zaten hesabın var mı? Giriş yap

source: Reset Password
tr: Şifre Sıfırla

# resetMailSent
source: Reset email sent!
tr: Sıfırlama e-postası gönderildi!

# resetPasswordButton
source: Send Reset Email
tr: Sıfırlama E-postası Gönder

source: Edit Pet
tr: Evcil Hayvanı Düzenle

# enterPetInfo
source: Enter your pet's information.
tr: Evcil hayvan bilgilerini girin.

source: Basic Info
tr: Temel Bilgiler

source: Pet Type
tr: Hayvan Türü

source: Select pet type
tr: Hayvan türü seç

# enterBreed
source: Please enter breed.
tr: Lütfen cins girin.

source: Female
tr: Dişi

source: Male
tr: Erkek

source: Select gender
tr: Cinsiyet seç

source: Select birth date
tr: Doğum tarihi seç

source: Interval Settings
tr: Aralık Ayarları

source: Satiety Interval
tr: Tokluk Aralığı

source: Happiness Interval
tr: Mutluluk Aralığı

source: Energy Interval
tr: Enerji Aralığı

source: Care Interval
tr: Bakım Aralığı

source: Save
tr: Kaydet

# feedingTimeLabel
source: Feeding Time:
tr: Beslenme Zamanı:

source: Not set
tr: Ayarlanmadı

# birthDateLabel
source: Birth Date
tr: Doğum Tarihi

source: Pet care notifications
tr: Evcil hayvan bakım bildirimleri

source: Sound Effects
tr: Ses Efektleri

source: Play interaction sounds
tr: Etkileşim seslerini çal

source: Photo
tr: Fotoğraf

source: Add Photo
tr: Fotoğraf Ekle

source: My Pets
tr: Evcil Hayvanlarım

source: Manage your pets
tr: Evcil hayvanlarını yönet

# petsLoading
source: Loading pets...
tr: Hayvanlar yükleniyor...

# noPetsAdded
source: No pets added yet!
tr: Henüz hayvan eklenmedi!

# addPetHint
source: Tap the + button to add your first pet.
tr: İlk hayvanını eklemek için + butonuna tıkla.

source: Hunger
tr: Açlık

# deletePetError
source: Failed to delete pet: {error}
tr: Hayvan silinemedi: {error}

source: Feeding time saved!
tr: Beslenme zamanı kaydedildi!

source: Vaccines to be taken
tr: Yapılacak Aşılar

source: Vaccines taken
tr: Yapılan Aşılar

# askQuestionChat
source: Ask a question in chat
tr: Sohbette soru sor

source: Owners
tr: Sahipler

source: Diary Chat
tr: Günlük Sohbet

# errorOccurred
source: An error occurred.
tr: Bir hata oluştu.

# noMessages
source: No messages yet.
tr: Henüz mesaj yok.

# writeMessage
source: Write a message...
tr: Mesaj yaz...

source: Chat History
tr: Sohbet Geçmişi

source: AI Chat
tr: AI Sohbet

source: New Chat
tr: Yeni Sohbet

# speakQuestion
source: Speak your question
tr: Sorunu sesli sor

# chatHint
source: Type your message...
tr: Mesajını yaz...

# feedbackThanks
source: Thank you for your feedback!
tr: Geri bildiriminiz için teşekkürler!

# feedbackDescription
source: Let us know your thoughts or issues.
tr: Düşüncelerinizi veya sorunlarınızı bize iletin.

source: Your message
tr: Mesajınız

# enterMessage
source: Please enter a message.
tr: Lütfen bir mesaj girin.

source: Send
tr: Gönder

# doneVaccineAdd
source: Mark as Done
tr: Yapıldı Olarak İşaretle

# vaccineAdd
source: Add Vaccine
tr: Aşı Ekle

source: Vaccine Name
tr: Aşı Adı

source: Select Date
tr: Tarih Seç

# doneVaccines
source: Completed Vaccines
tr: Tamamlanan Aşılar

source: Vaccines
tr: Aşılar

# noVaccines
source: No vaccines found.
tr: Aşı bulunamadı.

# date
source: Date: {date}
tr: Tarih: {date}

source: Delete Note
tr: Notu Sil

# deleteNoteConfirm
source: Are you sure you want to delete this note?
tr: Bu notu silmek istediğinize emin misiniz?

# noteDeleted
source: Note deleted successfully!
tr: Not başarıyla silindi!

# noteDeleteError
source: Error deleting note: {error}
tr: Not silinirken hata oluştu: {error}

source: Delete Pet
tr: Hayvanı Sil

# deletePetConfirm
source: Are you sure you want to delete this pet? This action cannot be undone.
tr: Bu hayvanı silmek istediğinize emin misiniz? Bu işlem geri alınamaz.

# petDeleted
source: Pet deleted successfully!
tr: Hayvan başarıyla silindi!

# petDeleteError
source: Error deleting pet: {error}
tr: Hayvan silinirken hata oluştu: {error}

# error
source: Error: {error}
tr: Hata: {error}

# deleteProfileError
source: Failed to delete profile: {error}
tr: Profil silinemedi: {error}

source: About App
tr: Uygulama Hakkında

source: Version
tr: Sürüm

source: Developer
tr: Geliştirici

# nameLabel
source: Name
tr: İsim

# emailLabel
source: Email
tr: E-posta

source: Logout
tr: Çıkış Yap

source: Delete Profile
tr: Profili Sil

# deleteProfileConfirm
source: Are you sure you want to delete your profile?
tr: Profilinizi silmek istediğinize emin misiniz?

source: Delete
tr: Sil

source: Edit Profile
tr: Profili Düzenle

# nameMinLengthError
source: Name must be at least 2 characters.
tr: İsim en az 2 karakter olmalı.

source: minutes
tr: dakika

source: Vaccine Time
tr: Aşı Zamanı

# statusInfoTitle
source: Status Information
tr: Durum Bilgileri

source: Details
tr: Detaylar

source: Dog
tr: Köpek

source: Cat
tr: Kedi

source: Bird
tr: Kuş

source: Fish
tr: Balık

source: Rabbit
tr: Tavşan

source: Other
tr: Diğer

source: Select from Gallery
tr: Galeriden Seç

source: Take Photo
tr: Fotoğraf Çek

# useRecognizedText
source: Use This Text
tr: Bu Metni Kullan

source: FAQ
tr: Sık Sorulan Sorular

# faqTitle
source: Frequently Asked Questions
tr: Sık Sorulan Sorular

# faqDescription
source: Common questions and answers about the app
tr: Uygulama hakkında sık sorulan sorular ve cevapları

# faqSearchHint
source: Search questions...
tr: Soru ara...

# faqStillNeedHelp
source: Still need help?
tr: Hala yardıma mı ihtiyacınız var?

# faqContactSupportTeam
source: Contact our support team
tr: Destek ekibimizle iletişime geçin

# faqEmail
source: Email
tr: E-posta

# faqFeedback
source: Feedback
tr: Geri Bildirim

# faqEmailDialogTitle
source: Send Email
tr: E-posta Gönder

# faqEmailDialogContent
source: Your email app will open and you can send a message to info@patitakip.com
tr: E-posta uygulamanız açılacak ve info@patitakip.com adresine mesaj gönderebileceksiniz

# faqGeneral
source: General Questions
tr: Genel Sorular

# faqFeatures
source: Features
tr: Özellikler

# faqPetCareHealth
source: Pet Care & Health
tr: Evcil Hayvan Bakımı & Sağlık

# faqPetLifestyle
source: Pet Lifestyle
tr: Evcil Hayvan Yaşam Tarzı

# faqTravelSocial
source: Travel & Social
tr: Seyahat & Sosyal

# faqTechnical
source: Technical Questions
tr: Teknik Sorular

# faqSupport
source: Support
tr: Destek

# faqWhatIsPatiTakip
source: What is PatiTakip?
tr: PatiTakip nedir?

# faqWhatIsPatiTakipAnswer
source: PatiTakip is a comprehensive mobile app designed to make pet care easier. It offers vaccination tracking, daily notes, AI-powered chat, and voice command features.
tr: PatiTakip, evcil hayvanlarınızın bakımını kolaylaştırmak için geliştirilmiş kapsamlı bir mobil uygulamadır. Aşı takibi, günlük notlar, yapay zeka destekli sohbet ve sesli komut özellikleri sunar.

# faqHowToAddPet
source: How do I add a pet?
tr: Evcil hayvan nasıl eklenir?

# faqHowToAddPetAnswer
source: You can add a new pet by clicking the + button on the main page. You need to enter basic information such as pet type, breed, gender, and birth date.
tr: Ana sayfada + butonuna tıklayarak yeni evcil hayvan ekleyebilirsiniz. Hayvan türü, cins, cinsiyet ve doğum tarihi gibi temel bilgileri girmeniz gerekiyor.

# faqHowToTrackVaccines
source: How do I track vaccinations?
tr: Aşı takibi nasıl yapılır?

# faqHowToTrackVaccinesAnswer
source: Go to the 'Vaccines' tab on the pet detail page to add new vaccines or view existing ones. You can mark completed vaccines as done.
tr: Evcil hayvan detay sayfasında 'Aşılar' sekmesine giderek yeni aşı ekleyebilir veya mevcut aşıları görüntüleyebilirsiniz. Tamamlanan aşıları işaretleyebilirsiniz.

# faqHowToUseAI
source: How do I use the AI chat feature?
tr: AI sohbet özelliği nasıl kullanılır?

# faqHowToUseAIAnswer
source: Click the AI button in the bottom right corner of the main page to chat with artificial intelligence. You can ask questions both in writing and by voice.
tr: Ana sayfada sağ alt köşedeki AI butonuna tıklayarak yapay zeka ile sohbet edebilirsiniz. Hem yazılı hem de sesli soru sorabilirsiniz.

# faqVoiceCommands
source: How do voice commands work?
tr: Sesli komutlar nasıl çalışır?

# faqVoiceCommandsAnswer
source: Press the microphone button on the AI chat page to ask questions by voice. The app converts your voice to text and AI responds.
tr: AI sohbet sayfasında mikrofon butonuna basarak sesli soru sorabilirsiniz. Uygulama sesinizi metne çevirir ve AI yanıt verir.

# faqNotifications
source: How do I set up notifications?
tr: Bildirimler nasıl ayarlanır?

# faqNotificationsAnswer
source: You can manage your notification preferences in Settings > Notifications. You can receive notifications for pet care reminders and vaccination times.
tr: Ayarlar > Bildirimler bölümünden bildirim tercihlerinizi yönetebilirsiniz. Evcil hayvan bakım hatırlatıcıları ve aşı zamanları için bildirim alabilirsiniz.

# faqDataBackup
source: Is my data safe?
tr: Verilerim güvenli mi?

# faqDataBackupAnswer
source: Yes, all your data is stored securely on Firebase cloud servers. Your data is always accessible when you log into your account.
tr: Evet, tüm verileriniz Firebase güvenli bulut sunucularında saklanır. Hesabınıza giriş yaptığınızda verileriniz her zaman erişilebilir.

# faqMultiplePets
source: Can I add multiple pets?
tr: Birden fazla evcil hayvan ekleyebilir miyim?

# faqMultiplePetsAnswer
source: Yes, you can add as many pets as you want. Each pet has its own profile and tracking system.
tr: Evet, istediğiniz kadar evcil hayvan ekleyebilirsiniz. Her hayvan için ayrı profil ve takip sistemi bulunur.

# faqShareAccount
source: Can I share my account with others?
tr: Hesabımı başkalarıyla paylaşabilir miyim?

# faqShareAccountAnswer
source: Yes, you can add other users from the 'Owners' section on the pet detail page. This way family members can also participate in pet care.
tr: Evet, evcil hayvan detay sayfasında 'Sahipler' bölümünden diğer kullanıcıları ekleyebilirsiniz. Bu sayede aile üyeleri de hayvan bakımına katılabilir.

# faqAppUpdates
source: How do app updates work?
tr: Uygulama güncellemeleri nasıl çalışır?

# faqAppUpdatesAnswer
source: You can set up automatic update settings in Settings > Update. New features and improvements are added regularly.
tr: Ayarlar > Güncelleme bölümünden otomatik güncelleme ayarlarını yapabilirsiniz. Yeni özellikler ve iyileştirmeler düzenli olarak eklenir.

# faqContactSupport
source: How can I contact the support team?
tr: Destek ekibiyle nasıl iletişime geçebilirim?

# faqContactSupportAnswer
source: You can contact our support team using the 'Send Feedback' section on this page or by sending an email directly.
tr: Bu sayfada 'Geri Bildirim Gönder' bölümünü kullanarak veya doğrudan e-posta göndererek destek ekibimizle iletişime geçebilirsiniz.

# faqPrivacyPolicy
source: What is the privacy policy?
tr: Gizlilik politikası nedir?

# faqPrivacyPolicyAnswer
source: Your personal data is securely protected and not shared with third parties. You can find our detailed privacy policy in the app.
tr: Kişisel verileriniz güvenle korunur ve üçüncü taraflarla paylaşılmaz. Detaylı gizlilik politikamızı uygulama içinde bulabilirsiniz.

# faqTermsOfService
source: What are the terms of service?
tr: Kullanım şartları nelerdir?

# faqTermsOfServiceAnswer
source: By using the app, you accept our terms of service. You can find the full text in the app.
tr: Uygulamayı kullanarak kullanım şartlarımızı kabul etmiş olursunuz. Tam metni uygulama içinde bulabilirsiniz.

# faqPetSocial
source: Can I share my pet's achievements with others?
tr: Sosyal aktiviteleri nasıl kaydedebilirim?

# faqPetSocialAnswer
source: Currently, the app focuses on individual pet tracking. However, you can share your pet's photos and achievements through your device's sharing features.
tr: Evcil hayvanınızın diğer hayvanlarla oyun zamanlarını, park ziyaretlerini ve sosyal aktivitelerini günlük notlarda kaydedebilirsiniz.

# aboutAppVersion
source: App Version
tr: Uygulama Sürümü

# aboutDeveloper
source: Developer
tr: Geliştirici

# aboutDeveloperValue
source: PatiTakip Team
tr: PatiTakip Ekibi

# aboutContact
source: Contact
tr: İletişim

# aboutWebsite
source: Website
tr: Web Sitesi

# aboutFeatures
source: Features
tr: Özellikler

# aboutFeaturesList
source: • Pet profile management • Vaccination tracking system • AI-powered chat • Voice command feature • Notification system • Multi-user support • Cloud backup
tr: • Evcil hayvan profili yönetimi • Aşı takip sistemi • Yapay zeka destekli sohbet • Sesli komut özelliği • Bildirim sistemi • Çoklu kullanıcı desteği • Bulut yedekleme

# aboutTechnology
source: Technologies
tr: Teknolojiler

# aboutPrivacy
source: Privacy
tr: Gizlilik

# aboutPrivacyText
source: Your data is stored securely and not shared with third parties. You can find our detailed privacy policy on our website.
tr: Verileriniz güvenle saklanır ve üçüncü taraflarla paylaşılmaz. Detaylı gizlilik politikamızı web sitemizde bulabilirsiniz.

# aboutSupport
source: Support
tr: Destek

# aboutSupportText
source: You can contact our support team for your questions. Your feedback is valuable to us.
tr: Sorularınız için destek ekibimizle iletişime geçebilirsiniz. Geri bildirimleriniz bizim için değerlidir.

# aboutRateApp
source: Rate App
tr: Uygulamayı Değerlendir

# aboutRateAppText
source: Rate your experience and help us improve.
tr: Deneyiminizi değerlendirin ve geliştirmemize yardımcı olun.

# aboutShareApp
source: Share App
tr: Uygulamayı Paylaş

# aboutShareAppText
source: Share PatiTakip with your friends.
tr: Arkadaşlarınızla PatiTakip'i paylaşın.

# aboutFollowUs
source: Follow Us
tr: Bizi Takip Edin

# aboutFollowUsText
source: Follow us on social media for updates and news.
tr: Güncellemeler ve haberler için sosyal medyada bizi takip edin.
